РП/src/InformationRegisters/ПараметрыПлатежныхДокументовПоНалогам/ПараметрыПлатежныхДокументовПоНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПлатежныхДокументовПоНалогам</name>
  <resources>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаУчетаУдержаний</name>
    <type>
      <types>CatalogRef.ГруппыУчетаНачисленийИУдержаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>CatalogRef.Налоги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

РП/src/InformationRegisters/ПараметрыПлатежныхДокументовПоНалогам/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ГруппаУчетаУдержанийПриИзменении(Элемент)
	УстановитьВидимостьИОчистить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИОчистить()
	
	Если Запись.ГруппаУчетаУдержаний = ПредопределенноеЗначение("Справочник.ГруппыУчетаНачисленийИУдержаний.ЕСВ") Тогда
		Элементы.КодДохода.Видимость = Ложь;
		Если ЗначениеЗаполнено(Запись.КодДохода) Тогда
			Запись.КодДохода = "";
		КонецЕсли;
		Элементы.Налог.Видимость = Истина;
		Элементы.ОбособленноеПодразделение.Видимость = Ложь;
		Если ЗначениеЗаполнено(Запись.ОбособленноеПодразделение) Тогда
			Запись.ОбособленноеПодразделение = "";
		КонецЕсли;
	Иначе
		Элементы.Налог.Видимость = Ложь;
		Если ЗначениеЗаполнено(Запись.Налог) Тогда
			Запись.Налог = "";
		КонецЕсли;
		Элементы.КодДохода.Видимость = Истина;
		Элементы.ОбособленноеПодразделение.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФункциональныеОпцииФормы()

	ПараметрыФО = Новый Структура("Организация", Запись.Организация);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьИОчистить();
	УстановитьФункциональныеОпцииФормы();
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьФункциональныеОпцииФормы();
КонецПроцедуры
